import deepcut
import codecs
sentences = deepcut.tokenize("จะยังไงจะเป็นความบังเอิญหรือฟ้าตั้งใจที่มันทำให้เธอและฉันได้พบได้เจอกันมีเรื่องราวให้ผูกพันจนมันทำให้ได้รู้ใจว่าใครที่มาทำให้ความเงียบเหงาหายไปและมาคอยแต่งเติมรอยยิ้มให้โลกสดใสวันทุกวันมีความหมายเธอคือใครที่ใจเฝ้ารอ")
fobj = codecs.open("OST.txt", "w", encoding="utf-8")
i=1
fobj.write('Machine Learning ตัดคำจากเนื้อเพลง\nอ้างอิงจาก\nเพลง ไม่ว่าอะไร (Wish this love) ประกอบซีรีส์ “บังเอิญรัก Love By Chance” \nศิลปิน ดิว อรุณพงศ์ \n\n')
fobj.write('Input ก่อนตัดคำ : \nจะยังไงจะเป็นความบังเอิญหรือฟ้าตั้งใจที่มันทำให้เธอและฉันได้พบได้เจอกันมีเรื่องราวให้ผูกพันจนมันทำให้ได้รู้ใจ\nว่าใครที่มาทำให้ความเงียบเหงาหายไปและมาคอยแต่งเติมรอยยิ้มให้โลกสดใสวันทุกวันมีความหมายเธอคือใครที่ใจเฝ้ารอ')
fobj.write('\nยิ่งใกล้กับเธอเท่าไรยิ่งเจอกับความอุ่นใจใครต่อใครคนใดก็ไม่สำคัญตาสบตาสื่อใจกันไม่เห็นต้องพูดอะไรกันเพียงเรายังมีกันจากนี้ไป')
fobj.write('\nอีกนานแค่ไหนเส้นทางจะแสนไกลไม่ว่าอะไรเราจะเดินไปด้วยกันผ่านวันเวลาแค่เธอจับมือฉันและฉันนั้นจะไม่ปล่อยมันรักเราจะเป็นนิรันดร์ไม่มีวันคลาย\n\nOutput หลังตัดคำ\n---------------------------------------------------------------------------------\n')
for word in sentences:
    fobj.write(word)
    fobj.write(' ')
    if i % 10 == 0:
        fobj.write("\n")
    i = i+1
sentences = deepcut.tokenize("ยิ่งใกล้กับเธอเท่าไรยิ่งเจอกับความอุ่นใจใครต่อใครคนใดก็ไม่สำคัญตาสบตาสื่อใจกันไม่เห็นต้องพูดอะไรกันเพียงเรายังมีกันจากนี้ไป")
i=1

fobj.write("\n\n")
for word in sentences:
    fobj.write(word)
    fobj.write(' ')
    if i % 10 == 0:
        fobj.write("\n")
    i = i+1

sentences = deepcut.tokenize('อีกนานแค่ไหนเส้นทางจะแสนไกลไม่ว่าอะไรเราจะเดินไปด้วยกันผ่านวันเวลาแค่เธอจับมือฉันและฉันนั้นจะไม่ปล่อยมันรักเราจะเป็นนิรันดร์ไม่มีวันคลาย')
i=1
fobj.write("\n\n")
for word in sentences:
    fobj.write(word)
    fobj.write(' ')
    if i % 10 == 0:
        fobj.write("\n")
    i = i+1
fobj.write('\n----------------------------------------------------------------------')

    